Revit 2027 API
RebarHostData.SetCoverType Method
 Associates the specified CoverType with the specified face of the element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCoverType(
	Reference face,
	RebarCoverType coverType
)
Public Sub SetCoverType (
	face As Reference,
	coverType As RebarCoverType
)
public:
void SetCoverType(
	Reference^ face,
	RebarCoverType^ coverType
)
member SetCoverType :
        face : Reference *
        coverType : RebarCoverType -> unit
Parameters
face Reference
coverType RebarCoverType
Exceptions
Exception | Condition
ArgumentException |  In this element, face does not have an associated CoverType, because it is not exposed.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace